# SQL Assignment

In [1]:
import pandas as pd
import sqlite3

from IPython.display import display, HTML

In [2]:
# Note that this is not the same db we have used in course videos, please download from this link
# https://drive.google.com/file/d/1O-1-L1DdNxEK6O6nG2jS31MbrMh-OnXM/view?usp=sharing

In [3]:
conn = sqlite3.connect("/content/Db-IMDB-Assignment.db")

#### Overview of all tables

In [4]:
tables = pd.read_sql_query("SELECT NAME AS 'Table_Name' FROM sqlite_master WHERE type='table'",conn)
tables = tables["Table_Name"].values.tolist()

In [5]:
for table in tables:
    query = "PRAGMA TABLE_INFO({})".format(table)
    schema = pd.read_sql_query(query,conn)
    print("Schema of",table)
    display(schema)
    print("-"*100)
    print("\n")

Schema of Movie

   cid       name     type  notnull dflt_value  pk
0    0      index  INTEGER        0       None   0
1    1        MID     TEXT        0       None   0
2    2      title     TEXT        0       None   0
3    3       year     TEXT        0       None   0
4    4     rating     REAL        0       None   0
5    5  num_votes  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Genre

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    GID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Language

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2   LAID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Country

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    CID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Location

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    LID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Location

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    LID     REAL        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Country

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    CID     REAL        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Language

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2   LAID  INTEGER        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Genre

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    GID  INTEGER        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Person

   cid    name     type  notnull dflt_value  pk
0    0   index  INTEGER        0       None   0
1    1     PID     TEXT        0       None   0
2    2    Name     TEXT        0       None   0
3    3  Gender     TEXT        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Producer

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Director

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Cast

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------

## Useful tips:

1. the year column in 'Movie' table, will have few chracters other than numbers which you need to be preprocessed, you need to get a substring of last 4 characters, its better if you convert it as int type, ex: CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER)

2. For almost all the TEXT columns we have show, please try to remove trailing spaces, you need to use TRIM() function

3. When you are doing count(coulmn) it won't consider the "NULL" values, you might need to explore other alternatives like Count(*)

## Q1 --- List all the directors who directed a 'Comedy' movie in a leap year. (You need to check that the genre is 'Comedy’ and year is a leap year) Your query should return director name, the movie name, and the year.

<h4>To determine whether a year is a leap year, follow these steps:</h4>

<ul>
    <li><b>STEP-1:</b> If the year is evenly divisible by 4, go to step 2. Otherwise, go to step 5.</li>
    <li><b>STEP-2:</b> If the year is evenly divisible by 100, go to step 3. Otherwise, go to step 4.</li>
    <li><b>STEP-3:</b> If the year is evenly divisible by 400, go to step 4. Otherwise, go to step 5.</li>
    <li><b>STEP-4:</b> The year is a leap year (it has 366 days).</li>
    <li><b>STEP-5:</b> The year is not a leap year (it has 365 days).</li>
</ul>

Year 1900 is divisible by 4 and 100 but it is not divisible by 400, so it is not a leap year.

In [6]:
def grader_1(q1):
    q1_results  = pd.read_sql_query(q1,conn)
    print(q1_results.head(10))
    assert (q1_results.shape == (232,3))

query1 =  """ 
          SELECT p.Name,m.title,CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER) AS ryear FROM 'Genre' g
          join M_Genre mg on g.GID = mg.GID
          join Movie m on m.MID = mg.MID 
          join M_Director md on md.MID = m.MID
          join Person p on p.PID = md.PID
          where g.Name LIKE '%Comedy%' and 
          ((ryear % 4 = 0 and ryear % 100 <> 0) or (ryear % 400 = 0))
          """
grader_1(query1)

                    Name                         title  ryear
0          Prakash Mehra                    Hera Pheri   1976
1             Raj Kanwar                       Deewana   1992
2           Priyadarshan                    Hera Pheri   2000
3           Naresh Kumar                 Gora Aur Kala   1972
4          Eeshwar Nivas  My Name Is Anthony Gonsalves   2008
5           Anees Bazmee                Singh Is Kinng   2008
6   Deepak S. Shivdasani           Mr. White Mr. Black   2008
7         Anurag Kashyap            Gangs of Wasseypur   2012
8           Rajat Kapoor                        Mithya   2008
9          Ravindra Dave                  Dulha Dulhan   1964

## Q2 --- List the names of all the actors who played in the movie 'Anand' (1971)

In [7]:

def grader_2(q2):
    q2_results  = pd.read_sql_query(q2,conn)
    print(q2_results.head(10))
    assert (q2_results.shape == (17,1))


query2 = """ SELECT P.NAME FROM PERSON P WHERE P.PID IN 
          (SELECT LTRIM(PID) FROM M_CAST C WHERE C.MID IN 
          (SELECT M.MID FROM MOVIE M WHERE TITLE='Anand')) """
grader_2(query2)

                Name
0   Amitabh Bachchan
1      Rajesh Khanna
2      Sumita Sanyal
3         Ramesh Deo
4          Seema Deo
5     Asit Kumar Sen
6         Dev Kishan
7       Atam Prakash
8      Lalita Kumari
9             Savita

## Q3 --- List all the actors who acted in a film before 1970 and in a film after 1990. (That is: < 1970 and > 1990.)

In [8]:


def grader_3a(query_less_1970, query_more_1990):
    q3_a = pd.read_sql_query(query_less_1970,conn)
    print(q3_a.shape)
    q3_b = pd.read_sql_query(query_more_1990,conn)
    print(q3_b.shape)
    return (q3_a.shape == (4942,1)) and (q3_b.shape == (62570,1))

query_less_1970 =""" 
Select p.PID from Person p 
inner join 
(
    select trim(mc.PID) PD, mc.MID from M_cast mc 
where mc.MID 
in 
(
    select mv.MID from Movie mv where CAST(SUBSTR(mv.year,-4) AS Integer)<1970
)
) r1 
on r1.PD=p.PID 
"""
query_more_1990 =""" 
Select p.PID from Person p 
inner join 
(
    select trim(mc.PID) PD, mc.MID from M_cast mc 
where mc.MID 
in 
(
    select mv.MID from Movie mv where CAST(SUBSTR(mv.year,-4) AS Integer)>1990
)
) r1 
on r1.PD=p.PID """
print(grader_3a(query_less_1970, query_more_1990))

# using the above two queries, you can find the answer to the given question

(4942, 1)
(62570, 1)
True

In [9]:

def grader_3(q3):
    q3_results  = pd.read_sql_query(q3,conn)
    print(q3_results.head(10))
    assert (q3_results.shape == (300,1))

query3 = """ Select p.PID from Person p 
inner join 
(
    select trim(mc.PID) PD, mc.MID from M_cast mc 
where mc.MID 
in 
(
    select mv.MID from Movie mv where CAST(SUBSTR(mv.year,-4) AS Integer)<1970
)
) r1 
on r1.PD=p.PID 
INTERSECT
Select p.PID from Person p 
inner join 
(
    select trim(mc.PID) PD, mc.MID from M_cast mc 
where mc.MID 
in 
(
    select mv.MID from Movie mv where CAST(SUBSTR(mv.year,-4) AS Integer)>1990
)
) r1 
on r1.PD=p.PID """
grader_3(query3)

         PID
0  nm0000821
1  nm0003987
2  nm0004334
3  nm0004429
4  nm0004432
5  nm0004433
6  nm0004434
7  nm0004435
8  nm0004564
9  nm0004569

## Q4 --- List all directors who directed 10 movies or more, in descending order of the number of movies they directed. Return the directors' names and the number of movies each of them directed.

In [10]:
%%time

def grader_4a(query_4a):
    query_4a = pd.read_sql_query(query_4a,conn)
    print(query_4a.head(10)) 
    return (query_4a.shape == (1462,2))

query_4a =""" select md.PID,count(md.MID) from M_Director md group by md.PID"""
print(grader_4a(query_4a))

# using the above query, you can write the answer to the given question

         PID  count(md.MID)
0  nm0000180              1
1  nm0000187              1
2  nm0000229              1
3  nm0000269              1
4  nm0000386              1
5  nm0000487              2
6  nm0000965              1
7  nm0001060              1
8  nm0001162              1
9  nm0001241              1
True
CPU times: user 12.8 ms, sys: 80 µs, total: 12.9 ms
Wall time: 13.4 ms

In [11]:

def grader_4(q4):
    q4_results  = pd.read_sql_query(q4,conn)
    print(q4_results.head(10))
    assert (q4_results.shape == (58,2))

query4 = """ select * from (select p.name,count(1) as cnt from M_Director md
            join Movie m on md.MID = m.MID
            join Person p on md.PID = p.PID
            group by md.PID) cn where cn.cnt>=10
            order by cn.cnt desc  """
grader_4(query4)

                    name  cnt
0           David Dhawan   39
1           Mahesh Bhatt   35
2           Priyadarshan   30
3        Ram Gopal Varma   30
4           Vikram Bhatt   29
5   Hrishikesh Mukherjee   27
6            Yash Chopra   21
7        Basu Chatterjee   19
8         Shakti Samanta   19
9           Subhash Ghai   18

## Q5.a --- For each year, count the number of movies in that year that had only female actors.

In [12]:
%%time

# note that you don't need TRIM for person table

def grader_5aa(query_5aa):
    query_5aa = pd.read_sql_query(query_5aa,conn)
    print(query_5aa.head(10)) 
    return (query_5aa.shape == (8846,3))

query_5aa =""" 
              SELECT Movie.MID, Person.Gender,COUNT(Person.Gender) as gender_count
              FROM Movie
              JOIN M_Cast ON Movie.MID = M_Cast.MID
              JOIN Person ON M_Cast.PID = Person.PID
              GROUP BY Movie.MID, Person.Gender
               
           """

print(grader_5aa(query_5aa))

def grader_5ab(query_5ab):
    query_5ab = pd.read_sql_query(query_5ab,conn)
    print(query_5ab.head(10)) 
    return (query_5ab.shape == (3469, 3))

query_5ab = """ 
              SELECT Movie.MID
              FROM Movie
              JOIN M_Cast
              ON Movie.MID = M_Cast.MID
              JOIN Person
              ON M_Cast.PID = Person.PID
              GROUP BY Movie.MID, Person.Gender
              HAVING COUNT(Person.Gender) >=1 AND Person.Gender ="Male"

            """

print(grader_5ab(query_5ab))


# using the above queries, you can write the answer to the given question

Empty DataFrame
Columns: [MID, Gender, gender_count]
Index: []
False
Empty DataFrame
Columns: [MID]
Index: []
False
CPU times: user 338 ms, sys: 12.6 ms, total: 350 ms
Wall time: 353 ms

In [13]:

def grader_5a(q5a):
    q5a_results  = pd.read_sql_query(q5a,conn)
    print(q5a_results.head(10))
    assert (q5a_results.shape == (4,2))

query5a = """ 
            select year,COUNT(MID) From Movie WHERE MID NOT IN
            (SELECT TRIM(MID) FROM M_cast WHERE TRIM(PID) IN 
            (SELECT PID FROM Person WHERE Gender='Male' OR Gender IS NULL)
            OR TRIM(PID) IS NULL GROUP BY MID) 
            GROUP BY year

          """
grader_5a(query5a)

     year  COUNT(MID)
0    1939           1
1    1999           1
2    2000           1
3  I 2018           1

## Q5.b --- Now include a small change: report for each year the percentage of movies in that year with only female actors, and the total number of movies made that year. For example, one answer will be: 1990 31.81 13522 meaning that in 1990 there were 13,522 movies, and 31.81% had only female actors. You do not need to round your answer.

In [14]:
%%time
def grader_5b(q5b):
    q5b_results  = pd.read_sql_query(q5b,conn)
    print(q5b_results.head(10))
    assert (q5b_results.shape == (4,3))

query5b = """ SELECT Temp.Year, 100* (CAST(Temp.cnt AS FLOAT)/Temp2.cnt) percentage, Temp2.cnt FROM 
            (SELECT M.Year,COUNT(*) cnt FROM Movie M WHERE M.MID IN 
            (SELECT DISTINCT M_C.MID FROM M_Cast M_C WHERE M_C.MID NOT IN
            (SELECT DISTINCT M_C.MID FROM M_Cast M_C WHERE TRIM(M_C.PID) IN 
            (SELECT P.PID FROM Person P WHERE P.Gender = 'Male') 
            OR M_C.PID IS NULL)) GROUP BY M.year) AS Temp JOIN  
            (SELECT M.year year, COUNT(*) cnt FROM Movie M GROUP BY M.year ) AS 
            Temp2 ON Temp.year=Temp2.year; """
grader_5b(query5b)

     Year  percentage  cnt
0    1939   50.000000    2
1    1999    1.515152   66
2    2000    1.562500   64
3  I 2018   10.000000   10
CPU times: user 140 ms, sys: 3.67 ms, total: 144 ms
Wall time: 144 ms

## Q6 --- Find the film(s) with the largest cast. Return the movie title and the size of the cast. By "cast size" we mean the number of distinct actors that played in that movie: if an actor played multiple roles, or if it simply occurs multiple times in casts, we still count her/him only once.

In [15]:
%%time
def grader_6(q6):
    q6_results  = pd.read_sql_query(q6,conn)
    print(q6_results.head(10))
    assert (q6_results.shape == (3473, 2))

query6 = """ select m.title,count(distinct  mc.PID) as castsize from M_Cast mc
            join Movie m on mc.MID = m.MID
            group by mc.MID order by castsize desc  """
grader_6(query6)

                        title  castsize
0               Ocean's Eight       238
1                    Apaharan       233
2                        Gold       215
3             My Name Is Khan       213
4  Captain America: Civil War       191
5                    Geostorm       170
6                     Striker       165
7                        2012       154
8                      Pixels       144
9       Yamla Pagla Deewana 2       140
CPU times: user 122 ms, sys: 5.81 ms, total: 128 ms
Wall time: 131 ms

### Q7 --- A decade is a sequence of 10 consecutive years. 
### For example, say in your database you have movie information starting from 1931. 
### the first decade is 1931, 1932, ..., 1940,
### the second decade is 1932, 1933, ..., 1941 and so on. 
### Find the decade D with the largest number of films and the total number of films in D

In [16]:
%%time
def grader_7a(q7a):
    q7a_results  = pd.read_sql_query(q7a,conn)
    print(q7a_results.head(10))
    assert (q7a_results.shape == (125, 2))

query7a = """ 
            SELECT Movie.year, COUNT(Movie.year) AS Num_Movies
            FROM Movie
            GROUP BY Movie.year
          """
grader_7a(query7a)

# using the above query, you can write the answer to the given question

   year  Num_Movies
0  1931           1
1  1936           3
2  1939           2
3  1941           1
4  1943           1
5  1946           2
6  1947           2
7  1948           3
8  1949           3
9  1950           2
CPU times: user 10.5 ms, sys: 0 ns, total: 10.5 ms
Wall time: 10.8 ms

In [17]:

def grader_7b(q7b):
    q7b_results  = pd.read_sql_query(q7b,conn)
    print(q7b_results.head(10))
    print(q7b_results.shape)
    assert (q7b_results.shape == (713, 4))

query7b = """  
WITH test7a AS
( SELECT Movie.year, COUNT(Movie.year) AS Num_Movies
FROM Movie
GROUP BY Movie.year
)
SELECT x.year AS Movie_Year, x.Num_Movies as xNum_Movies, y.year as yYear, y.Num_Movies AS Num_of_Movies
FROM test7a x, test7a y
WHERE y.year <=x.year+9 AND y.year >=x.year
          """
grader_7b(query7b)
# if you see the below results the first movie year is less than 2nd movie year and 
# 2nd movie year is less or equal to the first movie year+9

# using the above query, you can write the answer to the given question

  Movie_Year  xNum_Movies yYear  Num_of_Movies
0       1931            1  1931              1
1       1931            1  1936              3
2       1931            1  1939              2
3       1936            3  1936              3
4       1936            3  1939              2
5       1936            3  1941              1
6       1936            3  1943              1
7       1939            2  1939              2
8       1939            2  1941              1
9       1939            2  1943              1
(713, 4)

In [18]:

def grader_7(q7):
    q7_results  = pd.read_sql_query(q7,conn)
    print(q7_results.head(10))
    assert (q7_results.shape == (1, 2))

query7 = """ 
            WITH test7a AS
            ( SELECT Movie.year, COUNT(Movie.year) AS Num_Movies
            FROM Movie
            GROUP BY Movie.year
            ),
            test7b AS
            (SELECT x.year AS Movie_Year, y.Num_Movies AS Num_of_Movies
            FROM test7a x, test7a y
            WHERE y.year <=x.year+9 AND y.year >=x.year
            )
            SELECT test7b.Movie_Year AS DECADE ,SUM(test7b.Num_of_Movies) AS Decade_Movie_Count
            FROM test7b
            GROUP BY test7b.Movie_Year
            ORDER BY Decade_Movie_Count DESC
            LIMIT 1

        """
grader_7(query7)
# if you check the output we are printinng all the year in that decade, its fine you can print 2008 or 2008-2017

  DECADE  Decade_Movie_Count
0   2008                1126

## Q8 --- Find all the actors that made more movies with Yash Chopra than any other director.

In [19]:

def grader_8a(q8a):
    q8a_results  = pd.read_sql_query(q8a,conn)
    print(q8a_results.head(10))
    assert (q8a_results.shape == (73408, 3))

query8a = """ 
            SELECT 
                  c.PID actor,
                  d.PID director,
                  COUNT(c.MID) Movies 
              FROM 
                  M_Cast c 
              INNER JOIN 
                  M_Director d 
              ON 
                  c.MID=d.MID 
              GROUP BY 
                  TRIM(c.PID),
                  TRIM(d.PID)
          """
grader_8a(query8a)

# using the above query, you can write the answer to the given question

        actor   director  Movies
0   nm0000002  nm0496746       1
1   nm0000027  nm0000180       1
2   nm0000039  nm0896533       1
3   nm0000042  nm0896533       1
4   nm0000047  nm0004292       1
5   nm0000073  nm0485943       1
6   nm0000076  nm0000229       1
7   nm0000092  nm0178997       1
8   nm0000093  nm0000269       1
9   nm0000096  nm0113819       1

In [20]:

def grader_8(q8):
    q8_results  = pd.read_sql_query(q8,conn)
    print(q8_results.head(10))
    print(q8_results.shape)
    assert (q8_results.shape == (245, 2))

query8 =  """  
             SELECT
                  n1.ACTOR name,
                  n1.count count
              FROM
                  (SELECT
                      P.NAME ACTOR,
                      count(c.MID) COUNT,
                      c.PID AID
                  FROM
                      M_Cast c
                  INNER JOIN
                      PERSON p
                  ON
                      p.PID=TRIM(c.PID)
                  WHERE
                      c.MID
                      IN
                      (SELECT
                          MID
                      FROM
                          M_Director
                      WHERE
                          PID
                          IN
                          (SELECT
                              PID
                          FROM
                              Person p
                          WHERE
                              Name=' Yash Chopra'))
                          GROUP BY
                              c.PID) n1
              LEFT OUTER JOIN
                  (SELECT
                      max(count) as count,
                      AID
                  FROM (SELECT
                          count(c.MID) COUNT,
                          c.PID AID, d.PID
                      FROM M_Cast c
                      INNER JOIN
                          M_Director d ON c.MID=d.MID
                      WHERE
                          d.PID
                          IN
                          (SELECT
                              PID
                          FROM
                              Person p
                          WHERE
                              Name!=' Yash Chopra')
                          GROUP BY
                              c.PID,d.PID
                          ORDER BY
                              count DESC) GROUP BY
                          AID order by count desc) n2
                  ON
                      n1.AID=n2.AID
                  WHERE
                      n1.count>=IFNULL(n2.count,0)
                  ORDER BY
                      n1.count DESC
          """
grader_8(query8)

                name  count
0        Jagdish Raj     11
1   Manmohan Krishna     10
2           Iftekhar      9
3      Shashi Kapoor      7
4      Rakhee Gulzar      5
5     Waheeda Rehman      5
6           Ravikant      4
7     Achala Sachdev      4
8        Neetu Singh      4
9      Leela Chitnis      3
(245, 2)

## Q9 --- The Shahrukh number of an actor is the length of the shortest path between the actor and Shahrukh Khan in the "co-acting" graph. That is, Shahrukh Khan has Shahrukh number 0; all actors who acted in the same film as Shahrukh have Shahrukh number 1; all actors who acted in the same film as some actor with Shahrukh number 1 have Shahrukh number 2, etc. Return all actors whose Shahrukh number is 2.

In [21]:

def grader_9a(q9a):
    q9a_results  = pd.read_sql_query(q9a,conn)
    print(q9a_results.head(10))
    print(q9a_results.shape)
    assert (q9a_results.shape == (2382, 1))

query9a = """ 
            SELECT DISTINCT TRIM(PID) S1_PID 
              FROM M_Cast 
              WHERE MID IN 
                  (SELECT MID FROM M_Cast c 
                  WHERE TRIM(c.PID) 
                  IN (SELECT PID FROM Person 
                      WHERE Name = " Shah Rukh Khan")) 
              EXCEPT 
                  SELECT PID 
                  FROM Person 
                  WHERE Name = " Shah Rukh Khan"
          """
grader_9a(query9a)
# using the above query, you can write the answer to the given question

# selecting actors who acted with srk (S1)
# selecting all movies where S1 actors acted, this forms S2 movies list
# selecting all actors who acted in S2 movies, this gives us S2 actors along with S1 actors
# removing S1 actors from the combined list of S1 & S2 actors, so that we get only S2 actors

      S1_PID
0  nm0000818
1  nm0000821
2  nm0001934
3  nm0002043
4  nm0004109
5  nm0004334
6  nm0004335
7  nm0004363
8  nm0004418
9  nm0004429
(2382, 1)

In [22]:

def grader_9(q9):
    q9_results  = pd.read_sql_query(q9,conn)
    print(q9_results.head(10))
    print(q9_results.shape)
    assert (q9_results.shape == (25698, 1))

query9 = """ 
        SELECT P.Name FROM Person P WHERE TRIM(P.PID) IN 
        (SELECT DISTINCT TRIM(M_C.PID) FROM M_Cast M_C
        WHERE M_C.MID IN 
        (SELECT DISTINCT M_C.MID FROM M_Cast M_C WHERE TRIM(M_C.PID) IN
        (SELECT TRIM(M_C.PID) FROM M_Cast M_C WHERE M_C.MID IN 
        (SELECT DISTINCT M_C.MID FROM M_Cast M_C JOIN Person P ON TRIM(M_C.PID)=TRIM(P.PID)
        WHERE Trim(P.Name) = 'Shah Rukh Khan')) AND M_C.MID NOT IN 
        (SELECT M_C.MID FROM M_Cast M_C JOIN Person P ON TRIM(M_C.PID)=TRIM(P.PID)
        WHERE Trim(P.Name) = 'Shah Rukh Khan')) AND TRIM(M_C.PID) NOT IN 
        (SELECT TRIM(M_C.PID) FROM M_Cast M_C WHERE M_C.MID IN
        (SELECT DISTINCT M_C.MID FROM M_Cast M_C 
        JOIN Person P ON TRIM(M_C.PID)=TRIM(P.PID) 
        WHERE Trim(P.Name) = 'Shah Rukh Khan')))

        """
grader_9(query9)

                     Name
0            Freida Pinto
1             Rohan Chand
2            Damian Young
3         Waris Ahluwalia
4   Caroline Christl Long
5           Rajeev Pahuja
6       Michelle Santiago
7         Alicia Vikander
8            Dominic West
9          Walton Goggins
(25698, 1)